src/Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаРаботу</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.Пр_ПланФактовоеОтклонение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пр_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ОценкаВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ФактВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказчик</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Проекты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_НомерПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Пр_МодификацияФормСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определение и обработка создания формы
//
// Параметры:
// ЭтотОбъект - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
// 
Процедура ПриСозданииНаСервере(ЭтотОбъект, СтандартнаяОбработка, Отказ) Экспорт
	
	Если ЭтотОбъект.ИмяФормы = "Документ.ЗаданиеНаРаботу.Форма.ФормаДокумента" Тогда
		Документ_ЗаданиеНаРаботу_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ);	 
	ИначеЕсли ЭтотОбъект.ИмяФормы = "Справочник.Проекты.Форма.ФормаЭлемента" Тогда
		Справочник_Проекты_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ);
	ИначеЕсли ЭтотОбъект.ИмяФормы = "Документ.НачислениеЗарплатыУНФ.Форма.ФормаДокумента" Тогда
		Документ_НачислениеЗарплатыУНФ_Форма_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка, Отказ);
	ИначеЕсли ЭтотОбъект.ИмяФормы = "Справочник.ВидыЦенКонтрагентов.Форма.ФормаЭлемента" Тогда
		Справочник_ВидыЦенКонтрагентов_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ);
	ИначеЕсли ЭтотОбъект.ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		Справочник_Пользователи_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ);
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработка создания формы документа ЗаданиеНаРаботу
//
// Параметры:
// ЭтотОбъект - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
// 
Процедура Документ_ЗаданиеНаРаботу_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ)

	Элементы = ЭтотОбъект.Элементы;
	
	ДобавляемыеРеквизиты = Новый Массив; 
	СтатусЗадания = Новый РеквизитФормы("Пр_Статус",
										ОбщегоНазначения.ОписаниеТипаСтрока(0),,
										НСтр("ru = 'Статус'"));
	ДобавляемыеРеквизиты.Добавить(СтатусЗадания);
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Элементы.ГруппаВидИСостояние.Видимость = Ложь;
	Элементы.ГруппаЗаданиеУтвердил.Видимость = Ложь;
	Элементы.КоманднаяПанельРедактироватьСписком.Видимость = Ложь;
	Элементы.ПланированиеЗаказчикРабота.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Вставить("Пр_Статус", Тип("ПолеФормы"), Элементы.ЛеваяКолонка, Элементы.Сотрудник);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Пр_Статус";
	НовыйЭлемент.ЦветФона = WebЦвета.Голубой; 
	
	Элементы.ЛеваяКолонка.РастягиватьПоГоризонтали = Ложь;
	
	ГруппаПраваяКолонка = Элементы.Добавить("Пр_ПраваяКолонка", Тип("ГруппаФормы"), Элементы.Шапка);
	ГруппаПраваяКолонка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПраваяКолонка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПраваяКолонка.РастягиватьПоГоризонтали = Ложь;
	ГруппаПраваяКолонка.ОтображатьЗаголовок = Ложь;
	
	ГруппаПраваяКолонка1 = Элементы.Добавить("Пр_ПраваяКолонка1", Тип("ГруппаФормы"), ГруппаПраваяКолонка);
	ГруппаПраваяКолонка1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПраваяКолонка1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;    
	ГруппаПраваяКолонка1.ОтображатьЗаголовок = Ложь;
	
	ГруппаПраваяКолонка2 = Элементы.Добавить("Пр_ПраваяКолонка2", Тип("ГруппаФормы"), ГруппаПраваяКолонка);
	ГруппаПраваяКолонка2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПраваяКолонка2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	ГруппаПраваяКолонка2.ОтображатьЗаголовок = Ложь;
	
	Элементы.Шапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("Пр_Проект", Тип("ПолеФормы"), ГруппаПраваяКолонка1);  
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_Проект";      
	НовыйЭлемент.Заголовок = НСтр("ru = 'Проект'");
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "Пр_ПроектОбработкаВыбора");
	
	НовыйЭлемент = Элементы.Добавить("Пр_Идентификатор", Тип("ПолеФормы"),ГруппаПраваяКолонка1);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_Идентификатор";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Идентификатор GitLab'");
	НовыйЭлемент.ТолькоПросмотр = Истина; 
	
	НовыйЭлемент = Элементы.Добавить("Пр_ОценкаВGitLab", Тип("ПолеФормы"), ГруппаПраваяКолонка2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_ОценкаВGitLab";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Оценка в GitLab (Часы)'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("Пр_ФактВGitLab", Тип("ПолеФормы"), ГруппаПраваяКолонка2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_ФактВGitLab";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Факт в GitLab (Часы)'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
КонецПроцедуры

// Обработка создания формы справочника Проекты
//
// Параметры:
// ЭтотОбъекта - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
//
Процедура Справочник_Проекты_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ)

	Элементы = ЭтотОбъект.Элементы;
	
	НовыйЭлемент = Элементы.Добавить("Пр_ТокенДоступа", Тип("ПолеФормы"), Элементы.Реквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_ТокенДоступа";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Токен доступа GitLab'"); 
	
	НовыйЭлемент = Элементы.Добавить("Пр_НомерПроекта", Тип("ПолеФормы"), Элементы.Реквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_НомерПроекта";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Номер проекта GitLab'");
	
КонецПроцедуры

// Обработка создания формы документа НачислениеЗарплатыУНФ
//
// Параметры:
// ЭтотОбъекта - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
//
Процедура Документ_НачислениеЗарплатыУНФ_Форма_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка, Отказ)

	Элементы = ЭтотОбъект.Элементы;
	
	КомандаФормы = ЭтотОбъект.Команды.Добавить("Пр_РассчитатьЗППрограммистов");
	КомандаФормы.Действие = "Пр_РассчитатьЗППрограммистов";
	КомандаФормы.Заголовок = "Рассчитать ЗП программистов";
	
	КнопкаФормы = Элементы.Добавить("Пр_РассчитатьЗППрограммистов", Тип("КнопкаФормы"), Элементы.ГруппаКомандыРасчет);
	КнопкаФормы.ИмяКоманды = КомандаФормы.Имя;
	КнопкаФормы.Заголовок = КомандаФормы.Заголовок;
	КнопкаФормы.Шрифт = Новый Шрифт("Times New Roman", 11, Истина);
	КнопкаФормы.ЦветФона = WebЦвета.Розовый;
	
КонецПроцедуры

// Обработка создания формы справочника ВидыЦенКонтрагентов
//
// Параметры:
// ЭтотОбъекта - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
//
Процедура Справочник_ВидыЦенКонтрагентов_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ)

	Элементы = ЭтотОбъект.Элементы;
	
	НовыйЭлемент = Элементы.Добавить("Пр_Проект", Тип("ПолеФормы"), Элементы.НаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_Проект";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Проект'"); 
		
КонецПроцедуры  

// Обработка создания формы справочника Пользователи
//
// Параметры:
// ЭтотОбъекта - ФормаКлиентскогоПриложения
// СтандартнаяОбработка - Булево
// Отказ - Булево
//
Процедура Справочник_Пользователи_Форма_ФормаЭлемента(ЭтотОбъект, СтандартнаяОбработка, Отказ)

	Элементы = ЭтотОбъект.Элементы;
	
	НовыйЭлемент = Элементы.Добавить("Пр_ТокенДоступа", Тип("ПолеФормы"), Элементы.ИмяЭлектроннаяПочтаТелефон);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Пр_ТокенДоступа";
	НовыйЭлемент.Заголовок = НСтр("ru = 'Токен доступа'"); 
		
КонецПроцедуры

#КонецОбласти
